gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/server.cpp
//* *******************************************************************
//   Webserver
//
//   How it all works together:
//
//   page   0.htm         includes javascript j.js
//   script j.js          the javascript requests the JSON
//          json          returns data as JSON
//   css    f.css         css for all on flash (program) memory
//   php                  not really php - only a resource doing actions and not returning content (just http header 204 ok)
//   ***************************************************************** */
//

//*************************************************
// include headers depending on BOARDTYPE
//*************************************************

#include <Arduino.h>
#include <timeserver.h>
#include <waterlevel_defines.h>
#include <waterlevel.h>
#include <EvaluateSensor.h>
#include <MyLittleFSLib.h>
#include <stdio.h>
#include <string.h>

  #if (BOARDTYPE == ESP32)

  #include <WiFi.h>
  #include <ESP_Mail_Client.h>
  #include <WiFiClient.h>
  #include <WebServer.h>
  #include <ESPmDNS.h>

  //WebServer server(80); // an instance for the webserver
  extern WebServer server; // declare an instance for the webserver

#else // BOARDTYPE == ESP8266)
  // for Send-Mail
  #include <ESP_Mail_Client.h>

  #include <ESP8266WiFi.h>
  #include <ESP8266mDNS.h>       // Bonjour/multicast DNS, finds the device on network by name
  
  #include <WiFiClient.h>
  
  #include <ESP8266WebServer.h>  // for the webserver
  #include <ESP8266HTTPClient.h> // for the webclient https://github.com/esp8266/Arduino/tree/master/libraries/ESP8266HTTPClient
  #include <ArduinoOTA.h>        // OTA Upload via ArduinoIDE

  //#include <NTPClient.h> // get time from timeserver
  #include <WiFiUdp.h>

  ESP8266WebServer server(80); // an instance for the webserver
 

#endif


int val_AHHH;
int val_AHH;
int val_AH;
int val_AL;
// int val_ALL;

//**************************************************************
//**************************************************************
// global variables to simulate remote board
//**************************************************************
int remoteBoardId;
int remoteLevelAct;
int remoteDebugLevelSwitches;
int remoteAHH;
int remoteAH;
int remoteAL;
int remoteLastMessage;
int remoteMessagesSucessfull;

int sendToClient = isLiveSystem; // enable sending to client default is dependent on isLiveSystem
int useLiveMail  = 0; // to check the email send process, we want to use the live email address, because t-online is very slow

// **************************************************************************************************
// variables for simulation
// **************************************************************************************************
int debugLevelSwitches=0; // default off
int simVal_AHHH = 1;
int simVal_AHH  = 1;
int simVal_AH   = 1;
int simVal_AL   = 0;
int simError = 0;       //  sim one failed sendPost (ProjClient.cpp)
int simTimeout = 0;     //  sim timeout of watchdog timer
// int simVal_ALL = 0;

int firstRun = 1;
//int reloadDone = 1; // show if reload of handlePage is done

int time_steps = 0;


// **************************************************************************************************
void handleNotFound() {
// **************************************************************************************************
  // digitalWrite(builtin_led, 1);
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";

  for (uint8_t i = 0; i < server.args(); i++) {
    message += String(" "); 
    message += String(server.argName(i)) ;
    message += ": " ;
    message += server.arg(i) ;
    message += "\n";
  }

  server.send(404, "text/plain", message);
  // digitalWrite(builtin_led, 0);
}


// **************************************************************************************************
/* add a header  to each page including refs for all other pages */
void addTop(String &message)
// **************************************************************************************************
{
  message = F("<!DOCTYPE html>"
              "<html lang='en'>"
              "<head>"
              "<title>Wasserstand-Messung</title>"
              "<meta http-equiv=\"content-type\" content=\"text/html; charset=utf-8\">"
              "<meta name=\"viewport\" content=\"width=device-width\">"
              "<link rel='stylesheet' type='text/css' href='/f.css'>"
              "<script src='j.js'></script>"
              "</head>");
  message += F("<body>");
  message += F("<header><h1>" TXT_BOARDNAME " - Board " TXT_BOARDID "</h1>");
  message += F("<nav>" 
                  "<a href=\"/\">[Home]</a> <a href=\"filtered.htm\">[Value History]</a>" 
                  "<a href=\"graph.htm\">[Shorterm Graph]</a>" 
                  "<a href=\"update\">[OTA update]</a>" 
                  "</nav></header>"
               "<main>");
}

// **************************************************************************************************
/* The footer will display the uptime, the IP-address the version of the sketch and the compile date/time */
/* add code to calculate the uptime */
void addBottom(String &message)
{
// **************************************************************************************************

  message += F("</main>"
               "<footer><p>");
  message += F("<p>Actual Date and Time: ");

  message += currentDate;
  message += F(" -- ");
  message += formattedTime;
  message += F("<br>");

  if (seconds_since_startup > 604800)
  {
    message += F("<span id='week'>");
    message += ((seconds_since_startup / 604800) % 52);
    message += F("</span> weeks ");
  }
  if (seconds_since_startup > 86400)
  {
    message += F("<span id='day'>");
    message += ((seconds_since_startup / 86400) % 7);
    message += F("</span> days ");
  }
  if (seconds_since_startup > 3600)
  {
    message += F("<span id='hour'>");
    message += ((seconds_since_startup / 3600) % 24);
    message += F("</span> hours ");
  }

  message += F("<span id='min'>");
  message += ((seconds_since_startup / 60) % 60);
  message += F("</span> minutes ");

  message += F("<span id='sec'>");
  message += (seconds_since_startup % 60);
  message += F("</span> seconds since startup | Version " VERSION " | IP: ");
  message += WiFi.localIP().toString();
  message += F(" | " __DATE__ " " __TIME__ "</p></footer></body></html>");
  server.send(200, "text/html", message);
}

// the html output
// finally check your output if it is valid html: https://validator.w3.org

// **************************************************************************************************
// **************************************************************************************************
// *** HOME ***  0.htm
/* =======================================*/
/* main page of this application:
 *   - display water level as raw data
 *   - diaplay actual warn or alarm satus
 */
void handlePage()
// **************************************************************************************************
{
  String message;
  addTop(message);

  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" // here you write your html code for your homepage. Let's give some examples...
               "<p>Hier kann man den aktuellen Wasserstand in der Regenwasser-Zisterne  "
               "von Georg Zehentner, Streiblweg 19, Teisendorf ablesen.<br> "
               " Bei Überschreiten des Höchststand muss eine Pumpe aktiviert werden</p>"
               "</article>");

  message += F("<article>"
               "<h2>Rohdaten</h2><pre>");

  //************************************************ */
  // display stat of the relais input signals
  // input signals are low active
  message += F("Level Alarm  very high: <span id='val_AHHH'>");
  if (val_AHHH == 0)
  {
    message += F("active");
  }
  else
  {
    message += F("--");
  }
  message += F("</span><br>");
  message += F("Level Alarm   high: <span id='val_AHH'>");
  if (val_AHH == 0)
  {
    message += F("active");
  }
  else
  {
    message += F("--");
  }
  message += F("</span><br>");
  message += F("Level Warning high: <span id='val_AH' >");
  if (val_AH == 0)
  {
    message += F("active");
  }
  else
  {
    message += F("--");
  }
  message += F("</span><br>");
  message += F("Level Warning low:  <span id='val_AL' >");
  if (val_AL == 0)
  {
    message += F("active");
  }
  else
  {
    message += F("--");
  }

  message += F("</span><br>");

  message += F("</pre></article>");

  // ------------- end of display relais

  //-------------------------------------------------
  //  Prepare and send message, depending on alarmState
  //------------------------------------------------
  message += F("<article>"
               "<h2>Auswertung Wasserstand</h2>");

