gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/server.cpp
  if (alarmState == 6) 
    message += F("<message_err> Achtung extremer Starkregen -- beide Pumpen einschalten <br>Wasserstand &gt " Level_AHHH_Str "<br></message_err>");
  else if (alarmState == 5) 
    message += F("<message_err> Achtung Hochwasser -- Pumpe einschalten <br>Wasserstand &gt " Level_AHH_Str "<br></message_err>");

  else if (alarmState == 4)
    message += F("<message_warn> Wasserstand ist zwischen " Level_AH_Str" und " Level_AHH_Str "<br></message_warn>");
  
  else if (alarmState == 3)
    message += F("<message_ok> Wasserstand ist zwischen " Level_AL_Str " und " Level_AH_Str " <br></message_ok>");

  else if (alarmState == 2)
    message += F("<message_ok>   Wasserstand &lt; " Level_AL_Str "<br></message_ok>");
  else
    message += F("<message_ok>   Wasserstand &lt; " Level_AL_Str "<br>Alarmstate 1/0 <br></message_ok>");

  //------------------------------------------------
  // print when a new value arrives
  message += F("<br><br>  Zeit: ");
  message += formattedTime;
  message += F("   Wasserstand aktuell: ");
  message += myValueFilteredAct;

  message += F("<br><br>  maximal loop runtime over all: ");
  message += measureLoopAll.maxDelta;
  message += F(" ms<br><br>");

  message += F("<br><br>  maximal other tasks runtime: ");
  message += measureLoopOthers.maxDelta;
  message += F(" ms<br><br>");
  message += F("  maximal sensor runtime: ");
  message += measureSensor.maxDelta;
  message += F(" ms<br><br>");

  //-----------------------------------------------------------------------------------------
  // End of show message depending of alarmstate
  message += F("</article>");
  message += F("<head>"
"    <title>Seite neu laden</title>                         "
"    <script>                                               "
"        function reloadPage() {                            "
"            if (!sessionStorage.getItem('reloaded')) {     "
"                sessionStorage.setItem('reloaded', 'true');"
"                setTimeout(function() {                    "
"                   location.reload();                      "
"                }, 200);                                   "
"            }                                              "
"        }                                                  "
"                                                           "
"        window.onload = function() {                       "
"            sessionStorage.removeItem('reloaded');         "
"            console.log('Die Seite wurde neu geladen.');  "
"        };                                                 "
"    </script>                                              "
"</head>                                                    "
"</html>                                                    ");



  //-----------------------------------------------------------------------------------------
  // Simulation
  message += F("<article>\n"
  //-----------------------------------------------------------------------------------------
  "<h2>Simulation</h2>\n" 
  "<p>Zum Einschalten der Simulation klicke auf den obersten Schalter "
  "<br>rot : Debug ein"
  "<br><br>Um die Relais Eingänge zu schalten, klicke auf den entsprechenden Schalter<br>"
  "<br>AHH / AH : rot   --> überschritten"
  "<br>AHH / AH : grau  --> unterschritten"
  "<br>    / AL : grün  --> unterschritten"
  "<br>    / AL : grau  --> überschritten"
  "</p>");
  if (debugLevelSwitches == 1) // simulation aktiv = rot
  {
    message += F("<p class='on_red'><a href='c.php?toggle=a' target='i' onclick='reloadPage()' >Debug</a></p>\n");
  } else {
    message += F("<p class='off'><a href='c.php?toggle=a' target='i' onclick='reloadPage()'>Debug</a></p>\n");
  }
  
  if (simVal_AHHH == 0)  // low active => 0 = on = rot = higher than AHHH
  {
  message += F("<p class='on_red'><a href='c.php?toggle=0' target='i' onclick='reloadPage()'>AHHH</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=0' target='i' onclick='reloadPage()'>AHHH</a></p>\n");
  }
  
  if (simVal_AHH == 0)  // low active => 0 = on = rot = higher than AHH
  {
  message += F("<p class='on_red'><a href='c.php?toggle=1' target='i' onclick='reloadPage()'>AHH</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=1' target='i' onclick='reloadPage()'>AHH</a></p>\n");
  }
  if (simVal_AH == 0) // low active => higher than AH
  {
  message += F("<p class='on_red'><a href='c.php?toggle=2' target='i' onclick='reloadPage()'>AH</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=2' target='i' onclick='reloadPage()'>AH</a></p>\n");
  }
  if (simVal_AL == 0)  // low active => 0 = on = green => lower! than
  {
  message += F("<p class='on_green'><a href='c.php?toggle=3' target='i' onclick='reloadPage()'>AL</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=3' target='i' onclick='reloadPage()'>AL</a></p>\n");
  }
  
  if (simError == 1)  // 
  {
  message += F("<p class='on_red'><a href='c.php?toggle=6' target='i' onclick='reloadPage()'>Error</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=6' target='i' onclick='reloadPage()'>non error</a></p>\n");
  }
  if (simTimeout == 1)  // 
  {
  message += F("<p class='on_red'><a href='c.php?toggle=9' target='i' onclick='reloadPage()'>WD Err</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=9' target='i' onclick='reloadPage()'>WD ok</a></p>\n");
  }
  if (useLiveMail == 1)  // 
  {
  message += F("<p class='on_green'><a href='c.php?toggle=8' target='i' onclick='reloadPage()'>LiveMail</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=8' target='i' onclick='reloadPage()'>DevMail</a></p>\n");
  }
  
  if (sendToClient == 1)  // 
  {
  message += F("<p class='on_green'><a href='c.php?toggle=5' target='i' onclick='reloadPage()'>Post</a></p>\n");
  } else {
  message += F("<p class='off'><a href='c.php?toggle=5' target='i' onclick='reloadPage()'>nPost</a></p>\n");
  }

  message += F("<p class='on_red'><a href='c.php?CMD=reset_error_log' target='i' onclick='reloadPage()'>del errLog</a></p>\n");
  message += F("<p class='on_red'><a href='c.php?CMD=RESET' target='i' onclick='reloadPage()'>Reboot</a></p>\n");

  message += F("<iframe name='i' style='display:none' title='Tooltip' ></iframe>\n" // hack to keep the button press in the window
  //-----------------------------------------------------------------------------------------
  // end of simulation
  "</article>\n");



 //-----------------------------------------------------------------------------------------
  // Print error buffer
  message += F("<article>\n"

               //-----------------------------------------------------------------------------------------
               "<h2>Print errorbuffer</h2>\n"
               "<p>Falls ein Reset-Fehler auftritt wird dieser in das error.log geschrieben "
               "<br>Dieses wird hier angezeigt"
               "</p>");

  // open file for reading and check if it exists
  File file = LittleFS.open("/error.log", "r");
  if (!file) {
    Serial.println("Failed to open error.log nf for reading");
    message += "<br>File not found";
    Serial.println("error.log doesnt exist; generating a new one");

    String errMessage = "";
    errMessage = currentDate;
    errMessage += " - ";
    errMessage += formattedTime;
    errMessage += " - ";
    errMessage += "init error-file\n";
    appendFile("/error.log", errMessage.c_str());
    } else {

    // read from file line by line
    // prepare loop
    // define locals
    char c;
    
    while (file.available()) { 
      c = file.read();

      if  (c=='\n'){
        message += "<br>";
      } else {
        message += c;
      }
    }
    file.close();
  }
  //-----------------------------------------------------------------------------------------
 
    addBottom(message);
  server.send(200, "text/html", message);
}

//*********************************************************************************
/* print value history*/
void handleListFiltered()
//*********************************************************************************
{
  // what string length do we need?
  //   listing shortterm 
  //   - per line 25
  //  sum: 550 character without header and footer
  // 1 - message length: 513
  // 2 - message length: 3909
  
  String message = "";
  message.reserve(35000);

  String formattedTimeL= "";
  String formattedDateL= "";

  int iLine = iRingValueMax;

  addTop(message);

  Serial.print("1 - message length: "); 
  Serial.println(message.length());

  //------------------------------------------------------------------
  // shortterm values
  //-------------------------------------------------------------------
  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" 
               "<p>Shortterm values<br>Index ");
  message += filterCnt;             
  message += "<br> </p>";

  // create header of table
  message += "<pre>rdRingPtr  Time     Value ADC <br>";
  
  // read out ringbuffer and display values, but not more than maxLines lines
  for ( rdRingPtr = wrRingPtr+1; (rdRingPtr != wrRingPtr); ){
    // print only the last lines
    if (iLine <= maxLines) {
      message += rdRingPtr;
      message += "       ";

      formatDateAndTime(formattedTimeL, formattedDateL, ringTime[rdRingPtr]);
      message += formattedTimeL;

      message += "  ";
      message += ringValue[rdRingPtr];
      message += "  ";
      message += ringADC[rdRingPtr];
      message += "<br>";
      
