gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/server.cpp
    }

    if (rdRingPtr<iRingValueMax) {
      rdRingPtr++;
    } else {
      rdRingPtr = 0;
    }
    iLine--;
    
  }
  
  message += F("</pre></article><br>");

  addBottom(message);
  server.send(200, "text/html", message);
  
  Serial.print("2 - message length: "); 
  Serial.println(message.length());
}
//*********************************************************************************
/* print graph shortterm*/
void handleGraph()
//*********************************************************************************
{
  String graphXValues = "";     // values for graph (displayed)
  graphXValues.reserve(13000);

  String graphYValues = "";
  graphYValues.reserve(4000);

  String formattedTimeL= "";
  String formattedDateL= "";

  int noValues = 0;
  int iPoint = iRingValueMax;

  // prepare values for graph
  graphXValues  = "const xValues = [";
  graphYValues  = "const yValues = [";


  // read out ringbuffer and create the vector to display as graph
  for ( rdRingPtr = wrRingPtr+1; rdRingPtr != wrRingPtr; ){
    
    // if there is a valid time set (time="" means there is no value written since last startup)
    if (ringTime[rdRingPtr] != 0) {
      if (iPoint <= maxPoints) {
        // fill X values time
        graphXValues += "\"";
        formatDateAndTime(formattedTimeL, formattedDateL, ringTime[rdRingPtr]);
        graphXValues += formattedTimeL;

        graphXValues += "\", ";
        // take value and place it to the string for graph
        graphYValues += ringValue[rdRingPtr];
        graphYValues += ", ";
        noValues ++;
      }
    }
    if (rdRingPtr<iRingValueMax) {
      rdRingPtr++;
    } else {
      rdRingPtr = 0;
    }
    iPoint--;  
    }
  
    // enclose the generated strings with necessary brakets
    firstRun = 0;
    graphXValues += "];";
    graphYValues += "];";

    Serial.print("graphXValues: "); 
    Serial.println(graphXValues.length());
    Serial.print("graphYValues: "); 
    Serial.println(graphYValues.length());


  String message;
  message.reserve(20000);
  addTop(message);


  message += F("<article>"
               "<h2>Wasserstand Zehentner Teisendorf</h2>" 
               "<p>Line Graph -- Shortterm values<br> </p> "); 

  message += "<br>filterCnt= ";
  message += filterCnt;

  // print when a new value arrives
  message += F("<br><br>  Zeit: ");
  message += formattedTime;
  message += F("   Wasserstand aktuell: ");
  message += myValueFilteredAct;
  message += "</article>";

  message += "<script"
               " src=\"https://cdnjs.cloudflare.com/ajax/libs/Chart.js/2.9.4/Chart.js\">"
               "</script>";
  
  message += "<body><canvas id=\"Shortterm_chart\" style=\"width:100%;max-width:700px\"></canvas>";
  
  message += "<script>";
  message += graphXValues; 
  message += graphYValues; 

  message += "const graphYlevelWarn = [];";
  message += "generateWarnData(\"";
  message += Level_AH;
  message += "\",0,";
  message += noValues;
  message +=",1);";

  message += "const graphYlevelErro = [];";
  message += "generateErroData(\"";
  message += Level_AHH;
  message += "\",0,";
  message += noValues;
  message +=",1);";
  

  message +=  "new Chart(\"Shortterm_chart\", {";
  message +=  " type: \"line\",";
  message +=  " data: {";
  message +=  "   labels: xValues,";
  message +=  "   datasets: [{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 1,";
  message +=  "     pointRadius: 1,";
  message +=  "     backgroundColor: \"rgba(0,0,255,1.0)\",";
  message +=  "     borderColor: \"rgba(0,0,255,0.5)\",";
  message +=  "     label: \"Wasserstand [cm]\",";
  message +=  "     data: yValues";
  message +=  "     },{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 0,";
  message +=  "     pointRadius: 0,";
  message +=  "     backgroundColor: \"rgba(0,255,0,0)\",";
  message +=  "     borderColor: \"rgba(0,255,0,0.3)\",";
  message +=  "     label: \"Warnschwelle: ";
  message +=  Level_AH;
  message +=  " cm\",";
  message +=  "     data: graphYlevelWarn";
  message +=  "     },{";
  message +=  "     fill: false,";
  message +=  "     lineTension: 0,";
  message +=  "     pointRadius: 0,";
  message +=  "     backgroundColor: \"rgba(255,0,0,0)\",";
  message +=  "     borderColor: \"rgba(255,0,0,0.3)\",";
  message +=  "     label: \"Alarmschwelle: ";
  message +=  Level_AHH;
  message +=  " cm\",";
  message +=  "     data: graphYlevelErro";
  message +=  "   }]";
  message +=  " },";
  message +=  " options: {";
  message +=  "   title: {";
  message +=  "   display: false,";
  message +=  "   text: \"Wasserstand in cm\"";
  message +=  "   },";
  message +=  "   legend: {display: true, text: \"Wasserstand \"},";
  message +=  "   scales: {";
  message +=  "     yAxes: [{ticks: {min: 100, max:200}}]";
  message +=  "   }";
  message +=  " }";
  message +=  " });";
  message +=  " function generateWarnData(value, i1, i2, step = 1) {";
  message +=  "     for (let x = i1; x <= i2; x += step) {";
  message +=  "       ;";
  message +=  "       graphYlevelWarn.push(eval(value));";
  message +=  "     }";
  message +=  "   }";
  message +=  " function generateErroData(value, i1, i2, step = 1) {";
  message +=  "     for (let x = i1; x <= i2; x += step) {";
  message +=  "       ;";
  message +=  "       graphYlevelErro.push(eval(value));";
  message +=  "     }";
  message +=  "   }";
  message +=  "</script></body>";
            
  addBottom(message);

  Serial.print("message: "); 
  Serial.println(message.length());

  server.send(200, "text/html", message);


  graphXValues = "";                     // erase all values
  graphYValues = "";
    
}

//*********************************************************************************
void handleCss()
//*********************************************************************************
{
  // output of stylesheet
  // this is a straight forward example how to generat a static page from program memory
  String message;
  message = F("*{font-family:sans-serif}"
              "body{margin:10px}"
              "h1, h2{color:white;background:" CSS_MAINCOLOR ";text-align:center}"
              "h1{font-size:1.2em;margin:1px;padding:5px}"
              "h2{font-size:1.0em}"
              "h3{font-size:0.9em}"
              "p{color: black;}"
              "a{text-decoration:none;color:dimgray;text-align:center}"
              "main{text-align:center}"
              "article{vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:#E5E5E5;width:20em;text-align:left}" // if you don't like the floating effect (vor portrait mode on smartphones!) - remove display:inline-block
              "article h2{margin-top:0;padding-bottom:1px}"
              "section {margin-bottom:0.2em;clear:both;}"
              "table{border-collapse:separate;border-spacing:0 0.2em}"
              "th, td{background-color:#C0C0C0}"
              "button {margin-top:0.3em; color: black !important;}" // Added color: black !important;
              "footer p{font-size:0.8em;color:dimgray;background:silver;text-align:center;margin-bottom:5px}"
              "nav{background-color:silver;margin:1px;padding:5px;font-size:0.8em}"
              "nav a{color:dimgrey;padding:10px;text-decoration:none}"
              "nav a:hover{text-decoration:underline}"
              "nav p{margin:0px;padding:0px}"
              ".on_red, .on_green, .off{margin-top:0;margin-bottom:0.2em;margin-left:4em;font-size:1.4em;border-style:solid;border-radius:10px;border-style:outset;width:5em;height:1.5em;text-decoration:none;text-align:center}"
              ".off{color:black;background-color:gray;border-color:grey}"
              ".on_red{background-color:red;border-color:red}"
              ".on_green{background-color:green;border-color:green}"
              "message_ok  {color:white;vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:green ;width:19em;text-align:center}"
              "message_warn{color:white;vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:orange;width:19em;text-align:center}"
              "message_err {color:white;vertical-align:top;display:inline-block;margin:0.2em;padding:0.1em;border-style:solid;border-color:#C0C0C0;background-color:red   ;width:19em;text-align:center}"
            );
  server.send(200, "text/css", message);
}

//*********************************************************************************
// Output: send data to browser as JSON
// after modification always check if JSON is still valid. Just call the JSON (json) in your webbrowser and check.
void handleJson()
{
//*********************************************************************************
  //  Serial.println(F("D268 requested json"));
  String message = "";
  message = (F("{\"ss\":")); // Start of JSON and the first object "ss":
  message += millis() / 1000;
  message += (F(",\"val_AHH\":"));
  message += digitalRead(GPin_AHH);
  message += (F(",\"val_AH\":"));
  message += digitalRead(GPin_AH);
  message += (F(",\"val_AL\":"));
  message += digitalRead(GPin_AL);
  // message += (F(",\"val_ALL\":"));
  // message += digitalRead(GPin_ALL);
  message += (F("}"));                           // End of JSON
  server.send(200, "application/json", message); // set MIME type https://www.ietf.org/rfc/rfc4627.txt
}

//*********************************************************************************
// Output: a fetch API / JavaScript
// a function in the JavaScript uses fetch API to request a JSON file from the webserver and updates the values on the page if the object names and ID are the same
void handleJs()
//*********************************************************************************
{
  /* =======================================*/
  String message;
  message += F("const url ='json';\n"
               "function renew(){\n"
               " document.getElementById('sec').style.color = 'blue'\n" // if the timer starts the request, the second gets blue
               " fetch(url)\n"                                          // Call the fetch function passing the url of the API as a parameter
               " .then(response => {return response.json();})\n"
               " .then(jo => {\n"
               "   document.getElementById('sec').innerHTML = Math.floor(jo['ss'] % 60);\n" // example how to change a value in the HTML page
               "   for (var i in jo)\n"
               "    {if (document.getElementById(i)) document.getElementById(i).innerHTML = jo[i];}\n" // as long as the JSON name fits to the HTML id, the value will be replaced
               // add other fields here (e.g. the delivered JSON name doesn't fit to the html id
               // finally, update the runtime
               "   if (jo['ss'] > 60) { document.getElementById('min').innerHTML = Math.floor(jo['ss'] / 60 % 60);}\n"
               "   if (jo['ss'] > 3600) {document.getElementById('hour').innerHTML = Math.floor(jo['ss'] / 3600 % 24);}\n"
               "   if (jo['ss'] > 86400) {document.getElementById('day').innerHTML = Math.floor(jo['ss'] / 86400 % 7);}\n"
               "   if (jo['ss'] > 604800) {document.getElementById('week').innerHTML = Math.floor(jo['ss'] / 604800 % 52);}\n"
               "   document.getElementById('sec').style.color = 'dimgray';\n" // if everything was ok, the second will be grey again.
               " })\n"
               " .catch(function() {\n" // this is where you run code if the server returns any errors
               "  document.getElementById('sec').style.color = 'red';\n"
               " });\n"
               "}\n"
               "document.addEventListener('DOMContentLoaded', renew, setInterval(renew, ");
  message += ajaxIntervall * 1000;
  message += F("));");

