gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/server.cpp
  server.send(200, "text/javascript", message);
}

//*********************************************************************************
void handleCommand()
//*********************************************************************************
{

  int tempVal = 0;

  // receive command and handle accordingly
  Serial.println(F("D223 handleCommand"));
  for (uint8_t i = 0; i < server.args(); i++)
  {
    Serial.print(server.argName(i));
    Serial.print(F(": "));
    Serial.println(server.arg(i));
  }
  if (server.argName(0) == "toggle") // the parameter which was sent to this server
  {
    //reloadDone = 0;
    //Serial.println("reloadDone -> 0 -- Cmd = toggle");

    if (server.arg(0) == "a") // the value for that parameter
    {
      Serial.println(F("D232 toggle debug switch"));

      if (debugLevelSwitches == 1)
      { // toggle: if the pin was on - switch it of and vice versa
        debugLevelSwitches=0;
      }
      else
      {
        debugLevelSwitches=1;
      }
    }
    if (server.arg(0) == "0") // the value for that parameter
    {
      Serial.println(F("D232 toggle ahhh"));
      if (simVal_AHHH == 1) {simVal_AHHH = 0;} else {simVal_AHHH = 1;}
      digitalWrite(GPin_AHHH, simVal_AHHH);
    }
    if (server.arg(0) == "1") // the value for that parameter
    {
      Serial.println(F("D232 toggle ahh"));
      if (simVal_AHH == 1) {simVal_AHH = 0;} else {simVal_AHH = 1;}
      digitalWrite(GPin_AHH, simVal_AHH);
    }
    if (server.arg(0) == "2") // the value for that parameter
    {
      Serial.println(F("D232 toggle ah"));
      if (simVal_AH == 1) {simVal_AH = 0;} else {simVal_AH = 1;}
      digitalWrite(GPin_AH, simVal_AH);
    }
    if (server.arg(0) == "3") // the value for that parameter
    {
      Serial.println(F("D232 toggle al"));
      if (simVal_AL == 1) {simVal_AL = 0;} else {simVal_AL = 1;}
      digitalWrite(GPin_AL, simVal_AL);
    }
    if (server.arg(0) == "4") // the value for that parameter
    {
      Serial.println(F("D232 toggle all"));
      // if (simVal_ALL == 1) {simVal_ALL = 0;} else {simVal_ALL = 1;}
      // digitalWrite(GPin_AHH, simVal_ALL);
      // Serial.println(simVal_ALL);
    }
    if (server.arg(0) == "5") // the value for that parameter(led))
    {
      Serial.println(F("D232 toggle sendToClient"));
      if (digitalRead(builtin_led))
      { // toggle: if the pin was on - switch it of and vice versa
        digitalWrite(builtin_led, LOW);
        sendToClient = 1;  // enable sending to client in Wasserstand_V5.cpp
        Serial.println("sendToClient = 1");
      }
      else
      {
        digitalWrite(builtin_led, HIGH);
        //if (isLiveSystem==0) {
          sendToClient = 0;  // disable sending to client in dev version ofWasserstand_V5.cpp
          Serial.println("sendToClient = 0");
        //}
      }
    }
    if (server.arg(0) == "6") 
    {
      Serial.println(F("D232 toggle error generation"));
      if (simError==1)
      { // toggle error generation
        simError = 0;
        Serial.println("simError off");
      }
      else
      {
        // force error with sendPost to bplaced; response with negative code is forced
        if (debugLevelSwitches==1) {
          simError = 1;
          Serial.println("simError on");
        }
      }
    }

    if (server.arg(0) == "9") 
    {
      Serial.println(F("D232 toggle timeout generation"));
      if (simTimeout==1)
      { // toggle error generation
        simTimeout = 0;
        Serial.println("simTimeout off");
      }
      else
      {
        // force error with sendPost to bplaced; response with negative code is forced
        if (debugLevelSwitches==1) {
          simTimeout = 1;
          Serial.println("simTimeout on");
        }
      }
    }
    if (server.arg(0) == "8")
    {
      Serial.println(F("D232 toggle useLiveMail"));
      if (useLiveMail==1)
      { // toggle usage of mail address
        useLiveMail = 0;
        Serial.println("useLiveMail off");
      }
      else
      {
        // use web.de
        if (debugLevelSwitches==1) {
          useLiveMail = 1;
          Serial.println("useLiveMail on");
        }
      }
    }
  } // end of if argName(0) == toggle
  else if (server.argName(0) == "CMD" && server.arg(0) == "RESET") // Example how to reset the module. Just send ?CMD=RESET
  {
    Serial.println(F("D238 will reset"));
    ESP.restart();
  }

  else if (server.argName(0) == "CMD" && server.arg(0) == "reset_error_log") // reset error.log .../c.php?CMD=reset_error_log
  {
    Serial.println(F("D238 will delete error file"));
    deleteFile("/error.log");
  }

  // else if (server.argName(0) == "reloaded" && server.arg(0) == "true") 
  // {
  //   Serial.println(F("D238 will reload"));
  //   reloadDone = 1;
  // }

  // Serial.print("reloadDone : "); Serial.println(reloadDone);

// if (reloadDone==0) {
  if (false) {
    server.send(200, "text/html", "<html><body><script>localStorage.setItem('reloaded', 'true'); location.reload();</script></body></html>");
    // reloadDone = 1;
    Serial.println("200");
  } else {
    // reloadDone = 1;
    server.send(204, "text/plain", "No Content"); // this page doesn't send back content --> 204
    Serial.println("204");
  }
  
  setPegelforSimulation();

}

void handleData() {
// receives data from a remote board 
// and saves data to local variables
// it uses similar method like the command processing: 
// we receive parameters and store them in variables

  uint8_t counter = 0; // will count valid values
  for (uint8_t i = 0; i < server.args(); i++) {
    Serial.print(server.argName(i));
    Serial.print(F(": "));
    Serial.println(server.arg(i));
    if (server.argName(i) == "board")
    {
      remoteBoardId = server.arg(0).toInt();
      counter++;
    }
    else if (server.argName(i) == "levelAct")
    {
      remoteLevelAct = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "debug_level_switches")
    {
      remoteDebugLevelSwitches = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "AHH")
    {
      remoteAHH = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "AH")
    {
      remoteAH = server.arg(i).toInt();
      counter++;
    }
    else if (server.argName(i) == "AL")
    {
      remoteAL = server.arg(i).toInt();
      counter++;
    }
  }
  //example for errorhandling
  if (counter >= 1)
  {
    remoteLastMessage = millis() / 1000; // store the timestamp 
    remoteMessagesSucessfull++; // increase successfull submits
  }
  server.send(200, "text/plain", "OK");
}

