gzehentner/ESP32_Projects/Wasserstand_ESP_V07/src/server.cpp
// *** Remote Page ***  r.htm
void handlePageR()
{
  Serial.println("handlePageR entered");
  
  String message;
  addTop(message);
  message += F("<article>\n"
               "<h2>Remote Module</h2>\n"
               "<p>This page shows values which were received from a remote module.<p>\n"
               "<table>\n"
               "<tr><th>variable</th><th>value</th></tr>\n"

               "<tr><td>remoteBoardId</td><td>");
  message += remoteBoardId;
  message += F("</td></tr>\n"

               "<tr><td>remoteLevelAct</td><td>");
  message += remoteLevelAct;
  message += F("</td></tr>\n"

               "<tr><td>remoteDebugLevelSwitches</td><td>");
  message += remoteDebugLevelSwitches;
  message += F("</td></tr>\n"

               "<tr><td>AHH</td><td>");
  message += remoteAHH;
  message += F("</td></tr>\n"

               "<tr><td>AH</td><td>");
  message += remoteAH;
  message += F("</td></tr>\n"

               "<tr><td>AL</td><td>");
  message += remoteAL;
  message += F("</td></tr>\n");

  if (remoteMessagesSucessfull > 0)
  {
    message += F("<tr><td>remoteMessagesSucessfull</td><td>");
    message += remoteMessagesSucessfull;
    message += F("</td></tr>\n"
                 "<tr><td>seconds since last message</td><td>");
    message += (millis() / 1000) - remoteLastMessage;
    message += F("</td></tr>\n");
  }
  else
  {
    message += F("<tr><td>no external data received so far</td><td>-</td>");
  }
  message += F("</table>\n"
               "<p>If this module (the 'server') receives data from another remote module (the 'client'), data will be displayed.</p>\n"
               "<p>The data for the remote module is not updated, therefore you will need to reload this page. You can modify the handleJson() and this page to add that data.</p>\n"
               "</article>\n"
              );
  addBottom(message);
  server.send(200, "text/html", message);
}


//}
/*
=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*==*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=**=
========== end of including server.cpp
=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*==*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=*=**=
*/
